src/main/resources/sample/schibsted_maximo/service_request_from_maximo/Update_request_all_soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="servicerequest.synch.ticket.schibsted.com">
   <soapenv:Header/>
   <soapenv:Body>
     <ser:update>
              <!--Optional:-->
              <active>?</active>
              <!--Optional:-->
              <activity_due>?</activity_due>
              <!--Optional:-->
              <additional_assignee_list>?</additional_assignee_list>
              <!--Optional:-->
              <approval>?</approval>
              <!--Optional:-->
              <approval_history>?</approval_history>
              <!--Optional:-->
              <approval_set>?</approval_set>
              <!--Optional:-->
              <assigned_to>?</assigned_to>
              <assignment_group>?</assignment_group>
              <!--Optional:-->
              <business_duration>?</business_duration>
              <!--Optional:-->
              <business_service>?</business_service>
              <!--Optional:-->
              <calendar_duration>?</calendar_duration>
              <!--Optional:-->
              <close_notes>?</close_notes>
              <!--Optional:-->
              <closed_at>?</closed_at>
              <!--Optional:-->
              <closed_by>?</closed_by>
              <!--Optional:-->
              <cmdb_ci>?</cmdb_ci>
              <!--Optional:-->
              <comments>?</comments>
              <!--Optional:-->
              <comments_and_work_notes>?</comments_and_work_notes>
              <!--Optional:-->
              <company>?</company>
              <contact_type>?</contact_type>
              <!--Optional:-->
              <correlation_display>?</correlation_display>
              <!--Optional:-->
              <correlation_id>?</correlation_id>
              <!--Optional:-->
              <delivery_plan>?</delivery_plan>
              <!--Optional:-->
              <delivery_task>?</delivery_task>
              <!--Optional:-->
              <description>?</description>
              <!--Optional:-->
              <due_date>?</due_date>
              <!--Optional:-->
              <escalation>?</escalation>
              <!--Optional:-->
              <expected_start>?</expected_start>
              <!--Optional:-->
              <follow_up>?</follow_up>
              <!--Optional:-->
              <group_list>?</group_list>
              <!--Optional:-->
              <impact>?</impact>
              <!--Optional:-->
              <knowledge>?</knowledge>
              <!--Optional:-->
              <location>?</location>
              <!--Optional:-->
              <made_sla>?</made_sla>
              <!--Optional:-->
              <number>?</number>
              <!--Optional:-->
              <opened_at>?</opened_at>
              <!--Optional:-->
              <opened_by>?</opened_by>
              <!--Optional:-->
              <order>?</order>
              <!--Optional:-->
              <parent>?</parent>
              <!--Optional:-->
              <priority>?</priority>
              <!--Optional:-->
              <reassignment_count>?</reassignment_count>
              <!--Optional:-->
              <service_offering>?</service_offering>
              <short_description>?</short_description>
              <!--Optional:-->
              <skills>?</skills>
              <!--Optional:-->
              <sla_due>?</sla_due>
              <state>?</state>
              <sys_id>?</sys_id>
              <!--Optional:-->
              <time_worked>?</time_worked>
              <!--Optional:-->
              <u_1st_response_sent>?</u_1st_response_sent>
              <!--Optional:-->
              <u_1st_response_time>?</u_1st_response_time>
              <!--Optional:-->
              <u_affected_channels>?</u_affected_channels>
              <!--Optional:-->
              <u_all_companies_affected>?</u_all_companies_affected>
              <!--Optional:-->
              <u_call_created>?</u_call_created>
              <u_caller>?</u_caller>
              <!--Optional:-->
              <u_close_code>?</u_close_code>
              <!--Optional:-->
              <u_dispatch_comment>?</u_dispatch_comment>
              <!--Optional:-->
              <u_dispatch_reason>?</u_dispatch_reason>
              <!--Optional:-->
              <u_dispatched_as>?</u_dispatched_as>
              <!--Optional:-->
              <u_downtime>?</u_downtime>
              <!--Optional:-->
              <u_facility_level_1_service>?</u_facility_level_1_service>
              <!--Optional:-->
              <u_facility_level_2_service>?</u_facility_level_2_service>
              <!--Optional:-->
              <u_facility_service>?</u_facility_service>
              <!--Optional:-->
              <u_group_reassigned>?</u_group_reassigned>
              <!--Optional:-->
              <u_info_redirect>?</u_info_redirect>
              <!--Optional:-->
              <u_info_relay>?</u_info_relay>
              <!--Optional:-->
              <u_info_relay_text>?</u_info_relay_text>
              <!--Optional:-->
              <u_initiator>?</u_initiator>
              <!--Optional:-->
              <u_invoicing>?</u_invoicing>
              <!--Optional:-->
              <u_item>?</u_item>
              <!--Optional:-->
              <u_mail_html>?</u_mail_html>
              <!--Optional:-->
              <u_order_description>?</u_order_description>
              <!--Optional:-->
              <u_order_mail>?</u_order_mail>
              <!--Optional:-->
              <u_order_mails>?</u_order_mails>
              <!--Optional:-->
              <u_order_send_mail>?</u_order_send_mail>
              <!--Optional:-->
              <u_order_short_des>?</u_order_short_des>
              <!--Optional:-->
              <u_order_short_desc>?</u_order_short_desc>
              <!--Optional:-->
              <u_order_short_description>?</u_order_short_description>
              <!--Optional:-->
              <u_parent_task>?</u_parent_task>
              <!--Optional:-->
              <u_pause_sla>?</u_pause_sla>
              <!--Optional:-->
              <u_prev_order_short_des>?</u_prev_order_short_des>
              <!--Optional:-->
              <u_prev_order_short_desc>?</u_prev_order_short_desc>
              <!--Optional:-->
              <u_previous_group>?</u_previous_group>
              <!--Optional:-->
              <u_previous_task_type>?</u_previous_task_type>
              <!--Optional:-->
              <u_priority>?</u_priority>
              <!--Optional:-->
              <u_procurement_process>?</u_procurement_process>
              <!--Optional:-->
              <u_queue_time>?</u_queue_time>
              <!--Optional:-->
              <u_queue_time_ended>?</u_queue_time_ended>
              <!--Optional:-->
              <u_queue_time_started>?</u_queue_time_started>
              <!--Optional:-->
              <u_read_flag>?</u_read_flag>
              <!--Optional:-->
              <u_ready_for_pickup>?</u_ready_for_pickup>
              <!--Optional:-->
              <u_resolved_at>?</u_resolved_at>
              <!--Optional:-->
              <u_revisit>?</u_revisit>
              <!--Optional:-->
              <u_root_cause>?</u_root_cause>
              <!--Optional:-->
              <u_send_mail>?</u_send_mail>
              <u_service>?</u_service>
              <!--Optional:-->
              <u_sla_status>?</u_sla_status>
              <!--Optional:-->
              <u_source_task>?</u_source_task>
              <!--Optional:-->
              <u_sub_service>?</u_sub_service>
              <!--Optional:-->
              <u_supplier>?</u_supplier>
              <!--Optional:-->
              <u_support_rating>?</u_support_rating>
              <!--Optional:-->
              <u_support_rating_comment>?</u_support_rating_comment>
              <!--Optional:-->
              <u_task_integration_work_notes>?</u_task_integration_work_notes>
              <!--Optional:-->
              <u_template>?</u_template>
              <!--Optional:-->
              <u_tyr_location>?</u_tyr_location>
              <!--Optional:-->
              <u_vendor>?</u_vendor>
              <!--Optional:-->
              <u_workflow>?</u_workflow>
              <!--Optional:-->
              <upon_approval>?</upon_approval>
              <!--Optional:-->
              <upon_reject>?</upon_reject>
              <!--Optional:-->
              <urgency>?</urgency>
              <!--Optional:-->
              <user_input>?</user_input>
              <!--Optional:-->
              <watch_list>?</watch_list>
              <!--Optional:-->
              <work_end>?</work_end>
              <!--Optional:-->
              <work_notes>?</work_notes>
              <!--Optional:-->
              <work_notes_list>?</work_notes_list>
              <!--Optional:-->
              <work_start>?</work_start>
              <!--Optional:-->
              <u_number_external>?</u_number_external>
              <!--Optional:-->
              <assignment_group_external>?</assignment_group_external>
              <!--Optional:-->
              <u_vendor_classification>?</u_vendor_classification>
              <!--Optional:-->
              <caller_id>?</caller_id>
              <!--Optional:-->
              <resolved_at>?</resolved_at>
              <!--Optional:-->
              <u_vendor_status>?</u_vendor_status>
           </ser:update>   </soapenv:Body>
</soapenv:Envelope>
